app/Views/Stock/inbound.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_inbound`
WHERE `no_Po` = 'PO-220808001'
---
                        <td style="vertical-align: middle ;" align="center">
                            <?php
                                $db = \Config\Database::connect();
                                $jumlah = $db->table('tbl_inbound')->where('nopo', $user['no_Po'])->countAllResults();