app/Controllers/Inbound.php

    function detail()
    {
        if ($this->request->isAjax()) {
            $nopo = $this->request->getPost('nopo');
            $data = [
                'tampildatadetail'      => $this->ModelInbound->dataDetail($nopo),
                'detailin'              => $this->ModelInbound->getWhere(['nopo' => $nopo])
            ];
---
SELECT *
FROM `tbl_inbound`
WHERE `No_Po` = 'PO-220812005'