app/Models/InboundModel.php

    function tampilDataTransaksi()
    {
        return $this->table('tbl_inbound')->get();
---
SELECT *
FROM `tbl_inbound`

    public function dataDetail($nopo)
    {
        return $this->table('tbl_inbound')->where('nopo', $nopo)->get();
---
SELECT *
FROM `tbl_inbound`
WHERE `No_Po` = 'PO-220812005'