app/Models/InvoiceModel.php

    public function getDataItem()
    {
        return $this->db->table('tbl_invoice')->select(' Order_id,assign,Item_id,Item_detail,status, sum(quantity) as jumlah, count(Order_id) as order')
            ->groupBy('Order_id')->get()->getResult();
---
SELECT `Order_id`, `assign`, `Item_id`, `Item_detail`, `status`, sum(quantity) as jumlah
FROM `tbl_invoice`
GROUP BY `Order_id`