app/Models/ModelOrder.php

SELECT *
FROM `tbl_order`
---
    function tampilDataTransaksi()
    {
        return $this->table('tbl_order')->get()->getResultArray();