app/Models/PoModel.php

SELECT *
FROM `tbl_po`
---
    function tampilDataTransaksi()
    {
        return $this->table('tbl_po')->get();

SELECT RIGHT(no_Po, 3) as no_Po
FROM `tbl_po`
ORDER BY `no_Po` DESC
 LIMIT 1
---
    public function buatPo()
    {
        $kode = $this->db->table('tbl_po')->select('RIGHT(no_Po,3) as no_Po', false)->orderBy('no_Po', 'DESC')->limit(1)->get()->getRowArray();