app/Models/UploadPoModel.php

    function tampilDataTransaksi()
    {
        return $this->table('tbl_inbound')->get();
---
SELECT *
FROM `tbl_inbound`